{
  "data": [
    {
      "number_project": 1,
      "id_empresa": 1,
      "nivel_importancia": 6,
      "titulo": "Manpresa Web",
      "puesto": "Full-Stack",
      "cliente": "Mancomunado de prevención y salud laboral Maracay (Manpresa)",
      "tipo": ["Aplicación Web"],
      "lenguajes": ["Php", "Javascript"],
      "dbs": ["MySQL"],
      "frameworks": ["JQuery"],
      "url_sitio_web": "",
      "repositorio": "",
      "url_imagen_min": "1_min.jpg",
      "url_imagen_max": "1_max.jpg",
      "descripcion": "Se trata de una aplicación web hecha para la empresa “Manpresa” (Mancomunados de prevención y salud laboral), Esta aplicación además de servir para dar publicidad a los servicios de la empresa, cuenta con algunas funciones que facilitan los trabajos de gestión, administración y control de citas. Permite la creación de cuentas de usuarios tanto para empleados como para clientes con 3 niveles de jerarquías distintas. Cuenta también con su propio sistema de archivos, con la que pueden subir sus documentos y tenerlos disponibles en línea donde quiera que lo necesiten.",
      "descripcion_2": "La entera aplicación tanto a nivel de front-end, back-end, base de datos y planificación fue hecha por mi persona, la misma forma parte de mis pasantías Universitarias para obtener mi título como T.S.U EN INFORMÁTICA. "
    },


    {
        "number_project": 2,
        "id_empresa": 2,
        "nivel_importancia": 7,
        "titulo": "Menustarts",
        "puesto": "Full-Stack",
        "cliente": "Publico",
        "tipo": ["Aplicación Web"],
        "lenguajes": ["C#", "Javacript", "Php"],
        "dbs": ["MySQL"],
        "frameworks": ["Node", "Unity", "3D"],
        "url_sitio_web": "",
        "repositorio": "",
        "url_imagen_min": "2_min.jpg",
        "url_imagen_max": "2_max.jpg",
        "descripcion": "Se trata de una aplicación con 3 interfaces y plataformas distintas para ser operadas desde el mismo servidor, una interfaces para la web, otro para aplicaciones móviles y otro para una aplicación de escritorio. Este sistema fue pensado para agilizar el proceso de petición de órdenes de parte del cliente, la cocina y la caja registradora.",
        "descripcion_2": "Ayude en la planificación del proyecto sugiriendo ideas, desarrollando las primera interfaces Android, los patrones a seguir, y el diseño de la base de datos. Brinde soporte a los desarrolladores encargados de este proyecto."
    },

    {
      "number_project": 3,
      "id_empresa": 2,
      "nivel_importancia": 4,
      "titulo": "Subsistema generadora de inventarios INCES",
      "puesto": "Full-Stack",
      "cliente": "Instituto Nacional de Capacitación y Educación Socialista (INCES)",
      "tipo": ["Aplicación Web"],
      "lenguajes": ["Php", "Javascript"],
      "dbs": ["MySQL"],
      "frameworks": ["JQuery"],
      "url_sitio_web": "",
      "repositorio": "",
      "url_imagen_min": "3_min.jpg",
      "url_imagen_max": "3_max.jpg",
      "descripcion": "Un sistema pensado en solucionar los problemas de índole administrativo que presentaba el INSE, ellos constantemente necesitaban crear nuevos formularios para llevar algún tipo de registro, pero difícilmente estos contaban con la misma estructura de datos. Este sistema permite crear estos formularios con las características que necesiten en cada uno, indicando cuantos campos de textos, numéricos, checks u otros necesitan crear. <br /> <br /> Además de eso, se le puede dar uso a cada formulario creado y almacenar información en ellos, en teoría este proyecto es algo muy similar a un framework que te permite crear tus propios formularios ajustados a tus preferencias y necesidades.",
      "descripcion_2": "Fui uno de los que propusieron ideas para solucionar el problema, cree la base de datos, y desarrolle el back-end en conjunto con los demás miembros del equipo."
    },
    
    {
      "number_project": 4,
      "id_empresa": 3,
      "nivel_importancia": 8,
      "titulo": "Portafolio personal",
      "puesto": "Full-Stack",
      "cliente": "Mi persona",
      "tipo": ["Aplicación Web"],
      "lenguajes": ["Php", "Javascript"],
      "dbs": ["MongoDB"],
      "frameworks": ["Node", "React"],
      "url_sitio_web": "",
      "repositorio": "",
      "url_imagen_min": "4_min.jpg",
      "url_imagen_max": "4_max.jpg",
      "descripcion": "Se trata de esta misma aplicación Web, está pensado para hablar un poco acerca de mi carrera profesional y de los trabajos que he tenido, la misma esta hecho como una aplicación, decidir hacerla dinámica para que me permita hacer actualizaciones en la mostrada de una manera más rápida y sencilla. Inicialmente fue hecha en Php, y luego la mude a los framewords Node y React.",
      "descripcion_2": "Toda la Aplicación fue hecha por mi persona, incluyendo la plantilla html."
  },

    {
      "number_project": 5,
      "id_empresa": 3,
      "nivel_importancia": 5,
      "titulo": "Leislershop",
      "puesto": "Frontend",
      "cliente": "Leisler Molina",
      "tipo": ["Pagina Web"],
      "lenguajes": ["Php", "Javascript"],
      "dbs": ["MySQL"],
      "frameworks": ["Wordpress"],
      "url_sitio_web": "",
      "repositorio": "",
      "url_imagen_min": "5_min.jpg",
      "url_imagen_max": "5_max.jpg",
      "descripcion": "Se trata de una página para ofrecer servicios de marketing y con ella vender varios de los teléfonos de última tecnología populares para el momento que fue creada la página, no es una página muy compleja, su diseño pertenece a una plantilla de wordpress, aunque fue implementada con puro html y php vanilla. ",
      "descripcion_2": "Fui el unico responsable de la creación de la pagina"
  },

    {
      "number_project": 6,
      "id_empresa": 3,
      "nivel_importancia": 3,
      "titulo": "Pagina para Agencia de viajes",
      "puesto": "Frontend",
      "cliente": "",
      "tipo": ["Pagina Web"],
      "lenguajes": [""],
      "dbs": [""],
      "frameworks": [""],
      "url_sitio_web": "",
      "repositorio": "",
      "url_imagen_min": "6_min.jpg",
      "url_imagen_max": "6_max.jpg",
      "descripcion": "Se trata de una página hecha para ofrecer los servicios y ofertas de viaje de una agencia en particular, Es una página sumamente sencilla, de la que no se le siguió dando mantenimiento.",
      "descripcion_2": "Fui quien hizo la entera página."
    },

    {
      "number_project": 7,
      "id_empresa": 3,
      "nivel_importancia": 7,
      "titulo": "digitalsmd",
      "puesto": "Frontend",
      "cliente": "digitalsmd",
      "tipo": ["Pagina Web"],
      "lenguajes": ["Javascript"],
      "dbs": [""],
      "frameworks": ["React"],
      "url_sitio_web": "digitalsmd.com",
      "repositorio": "",
      "url_imagen_min": "7_min.jpg",
      "url_imagen_max": "7_max.jpg",
      "descripcion": "Es una página hecha para ofrecer los servicios de publicidad que ofrece la empresa, ellos ofrecen distintos servicios de publicidad a negocios pequeños de la localidad, no hablamos de publicidad web, sino todo lo que cuente para lo mismo, como publicidad en radio y periódicos.",
      "descripcion_2": "Fui en único responsable del proyecto."
   },

    {
      "number_project": 8,
      "id_empresa": 3,
      "nivel_importancia": 10,
      "titulo": "Technodegy",
      "puesto": "Full-Stack",
      "cliente": "Publico",
      "tipo": ["Aplicación Web"],
      "lenguajes": ["Javascript"],
      "dbs": ["MongoDB"],
      "frameworks": ["Node", "React", "Nest"],
      "url_sitio_web": "technodegy.com",
      "repositorio": "github.com/christianwx5/technodegy-nest-mongodb",
      "url_imagen_min": "8_min.jpg",
      "url_imagen_max": "8_max.jpg",
      "descripcion": "Se trata de una aplicación pensada para ofrecer mis servicios como consultora independiente, sin embargo no pude darle uso debido a que termine enfocándome solo en la empresa que me contrato poco después y me termino quedando de portafolio. La misma fue hecha con React y Node, ya que le añadí un par de funciones de manera de facilitar el llenado de información en ciertos sectores, de manera de no tener que cambiar el contenido del diseño si no solo hacer llenado de la bd, para facilitar su futuro mantenimiento.",
      "descripcion_2": "La entera página fue hecha por mi persona, tanto a nivel de front-end como del backend."
    },

    {
      "number_project": 9,
      "id_empresa": 3,
      "nivel_importancia": 6,
      "titulo": "Rami Make",
      "puesto": "Full-Stack",
      "cliente": "Rami Make UP. CA",
      "tipo": ["Aplicación Web"],
      "lenguajes": ["Java"],
      "dbs": ["MySQL"],
      "frameworks": [""],
      "url_sitio_web": "",
      "repositorio": "",
      "url_imagen_min": "9_min.jpg",
      "url_imagen_max": "9_max.jpg",
      "descripcion": "Se trata de una aplicación de escritorio hecha en java para una tienda de venta de cosméticos, la misma funciona como un control de inventario, con el que pueden llevar un registro de los productos que llegan y salen del almacén, cuenta con 2 niveles de usuarios.",
      "descripcion_2": "La entera aplicación fue hecha por mi persona"
    },

    
    {
      "number_project": 10,
      "id_empresa": 4,
      "nivel_importancia": 7,
      "titulo": "IVSS Administrative system",
      "puesto": "Full-Stack",
      "cliente": "Ambulatorio IVSS",
      "tipo": ["Aplicación de escritorio"],
      "lenguajes": ["Java"],
      "dbs": ["MySQL"],
      "frameworks": [""],
      "url_sitio_web": "",
      "repositorio": "",
      "url_imagen_min": "2_min.jpg",
      "url_imagen_max": "2_max.jpg",
      "descripcion": "Esta es una aplicación creada para el área administrativa del ambulatorio del Seguro Social del Limón (IVSS), esta aplicación es un sistema completo debido a que cuenta con varias funciones en 3 áreas distintas y que interactúan y comparten información entre ellas. Sus 3 principales funciones son: Generador de Reposos automático, Generador de plan de guardia y un control de inventario que atiende tanto la requisición interna como la externa.",
      "descripcion_2": "La entera aplicación fue hecha por mi persona, la misma forma parte de mis pasantías Universitarias para el título de INGENIERÍA EN SISTEMAS. "
    },

    {
      "number_project": 11,
      "id_empresa": 5,
      "nivel_importancia": 10,
      "titulo": "Rune Jarvis",
      "puesto": "Backend",
      "cliente": "Jugadores de OSRS",
      "tipo": ["Aplicación de escritorio"],
      "lenguajes": ["C#"],
      "dbs": ["SQLite"],
      "frameworks": [".NET"],
      "url_sitio_web": "",
      "repositorio": "",
      "url_imagen_min": "11_min.jpg",
      "url_imagen_max": "11_max.jpg",
      "descripcion": "Este fue en su momento un proyecto bastante llamativo, principalmente por el nivel de complejidad que requería el algoritmo detrás de él. Se trata de un grupo de bots (Robots) informáticos creados con el fin de ser capaces de realizar distintas tareas en un juego conocido como “OSRS” de manera autónoma. Podemos decir, en pocas palabras, que estos bots simulan ser un jugador real que manipula el ordenador para interactuar con el juego.<br /><br />Aunque se trate de bots, no tienen que ver con los bots que hoy en día son conocidos por todos, hablamos de bots con funciones como escanear la pantalla y actuar en consecuencia de lo que observe (ejemplo si detecta tener la barra de vida baja procede a ejecutar la función de alimentarse).",
      "descripcion_2": "Fui el creador de todos los bots."
  },

  {
    "number_project": 12,
    "id_empresa": 5,
    "nivel_importancia": 10,
    "titulo": "Super hunter",
    "puesto": "Backend",
    "cliente": "Jugadores de OSRS",
    "tipo": ["Aplicación de escritorio"],
    "lenguajes": ["C#"],
    "dbs": ["SQLite"],
    "frameworks": [".NET"],
    "url_sitio_web": "",
    "repositorio": "",
    "url_imagen_min": "12_min.jpg",
    "url_imagen_max": "12_max.jpg",
    "descripcion": "Es uno de los bots con el algoritmo más complejo, debido a la cantidad de variaciones y combinaciones posibles de elegir a la hora de vigilar y tomar lo que capturen cada una de las trampas puestas para capturar las criaturas. <br /><br /> Permite al usuario configurarlo y guardar en la base de datos la configuración hecha, de manera que pueda adaptar el bot a cada zona diferente de cacería, el mismo se puede configurar para detectar todos los estados de las rampas, ya sea inactivo, activo o derribado. <br /><br /> La metodología es más o menos la siguiente: una vez configurado y activado el bot, el escaneara todos los puntos donde deben haber trampas, va colocando uno a uno mientras falten por poner. Una vez todas puestas supervisara cuál de ellas  es activada (captura una criatura), procede a tomar la presa, recoge la trampa y la vuelve a colocar, regresando el ciclo de supervisar las trampas de nuevo. Esto hasta detectar que el bolso se llene, recoge todo y usar el portal para depositar todo en el banco.",
    "descripcion_2": ""
  },

  {
    "number_project": 13,
    "id_empresa": 5,
    "nivel_importancia": 10,
    "titulo": "Wine thief",
    "puesto": "Backend",
    "cliente": "Jugadores de OSRS",
    "tipo": ["Aplicación de escritorio"],
    "lenguajes": ["C#"],
    "dbs": ["SQLite"],
    "frameworks": [".NET"],
    "url_sitio_web": "",
    "repositorio": "",
    "url_imagen_min": "13_min.jpg",
    "url_imagen_max": "13_max.jpg",
    "descripcion": "Este es el bot mas trabajado y detallado de todos, tiene instrucciones tan específicas que lo hace un bot bastante dinámica, autónomo y con un mínimo de inteligencia. <br /><br />El mismo se encarga de recolectar vinos sagrados (zamorak), de un templo sagrado en específico, a diferencia de los otros bots, este no requiere ser configurado, este bot es tan completo como para ajustarse el mismo ubicándose en el entorno en el que se encuentre. Tomando decisiones al saber en qué piso del templo se encuentre, siendo capaz de bajar y subir las escaleras por sí solo, tomar jarrones de ambos pisos, estar al tanto de la vida y comer cuando sea necesario, tomar pociones de energía y tomar el jarrón apenas aparezca, haciendo de tal manera que se disimule que es una persona y no un bot. <br /><br />Uno de los retos más grande que tuvo este bot, es que esa zona es muy vigilada por los creadores del juego que cuentan con un software capas de detectar si el comportamiento de los jugadores es de un jugador normal o real y no de un bot. El bot fue pensado de manera de crear patrones de comportamiento algo variados, tomando en cuenta que el ser humano funciona con aproximaciones y no con resultados exactos, el bot busca trabajar de la misma manera para no ser detectado como bot.",
    "descripcion_2": ""
  },

  {
    "number_project": 14,
    "id_empresa": 5,
    "nivel_importancia": 10,
    "titulo": "Sand crabs destroyer",
    "puesto": "Backend",
    "cliente": "Jugadores de OSRS",
    "tipo": ["Aplicación de escritorio"],
    "lenguajes": ["C#"],
    "dbs": ["SQLite"],
    "frameworks": [".NET"],
    "url_sitio_web": "",
    "repositorio": "",
    "url_imagen_min": "14_min.jpg",
    "url_imagen_max": "14_max.jpg",
    "descripcion": "Se trata de un bot con un código muy simple pero sumamente útil, es el bot más usado, en ocasiones incluso durante 24h o más horas seguidas. <br /><br />Existe una zona donde se puede subir de nivel sin mucho esfuerzo matando a unas criaturitas difíciles de matar por su dureza por lo que tardan en morir, y su golpe no hace casi nada de daño, el bot deja que el personaje pelee solo contra ellos y en lo que estos dejan de combatir, el bot detecta que está inactivo, recorre la isla buscando regresar al mismo punto para que este vuelva a ponerse en estado de combate, cada vez que lo hace se asegura de tener las posiciones necesarias para poder obtener mayor puntaje y comer si es necesario. El bot puede permanecer horas y días activo subiendo de nivel, pero al no tener mucho código, si llegase a haber un problema o se des configura por alguna razón, este suelta una alarma para avisar que necesita ser ajustado o para despertar al usuario en caso de que este trabajando de noche. <br /><br />Este bot fue de tremenda ayuda pues literalmente permitía al usuario enfocarse en otra cosa (como en programar mas bots) mientras él iba subiendo de niveles las cuentas por sí solo.",
    "descripcion_2": ""
  },

  {
    "number_project": 15,
    "id_empresa": 5,
    "nivel_importancia": 10,
    "titulo": "Battles in dream",
    "puesto": "Backend",
    "cliente": "Jugadores de OSRS",
    "tipo": ["Aplicación de escritorio"],
    "lenguajes": ["C#"],
    "dbs": ["SQLite"],
    "frameworks": [".NET"],
    "url_sitio_web": "",
    "repositorio": "",
    "url_imagen_min": "15_min.jpg",
    "url_imagen_max": "15_max.jpg",
    "descripcion": "Este bot también se usa para subir niveles de combate, pero esta vez se usa alcanzar niveles más altos donde se requieren contrincantes más poderosos. <br /><br /> Existe una zona donde se puede pagar para entrar en una zona de combate donde se enfrenta a enemigos finales con los que ya ha peleado. El bot permite que pueda tomar las opciones que le permiten permaneces de pie durante horas, y está al tanto de reiniciar el ciclo cada minuto. Permitiendo al usuario estar despreocupado del personaje mientras este sube de nivel por horas.",
    "descripcion_2": ""
  },

  {
    "number_project": 16,
    "id_empresa": 5,
    "nivel_importancia": 10,
    "titulo": "Parkour",
    "puesto": "Backend",
    "cliente": "Jugadores de OSRS",
    "tipo": ["Aplicación de escritorio"],
    "lenguajes": ["C#"],
    "dbs": ["SQLite"],
    "frameworks": [".NET"],
    "url_sitio_web": "",
    "repositorio": "",
    "url_imagen_min": "16_min.jpg",
    "url_imagen_max": "16_max.jpg",
    "descripcion": "Se trata de un bot capaz de pasar todos los obstáculos que haya en alguna pista para entrenar las habilidades de agilidad. Haciendo que el personaje corra, brinque, salte, suba trampas, escaleras, brinque techos y cualquier otro obstáculo que se le presente. <br /><br /> Este bot debe ser configurado pues no todas las zonas cuentan con los mismos obstáculos, luego ya queda casi 100% automático, permitiendo que el usuario se enfoque en otra cosa mientras él va subiendo las habilidades del personaje. <br /><br /> La última función que tuvo le permitía detectar cuando se caía de alguna rampa y hacia que el personaje volviera al punto de partida para seguirlo intentando. (Anteriormente tenía que hacerlo el usuario y el bot solo avisaba que se había caído). <br /><br /> También se podía configurar para que tome las monedas que aparecen  de vez en cuando, esto para no ser detectado como bot, pues esas monedas representan conchas de mango para detectar bot, (estos bot son pilas en ese sentido).",
    "descripcion_2": ""
  },

  {
    "number_project": 17,
    "id_empresa": 5,
    "nivel_importancia": 10,
    "titulo": "Orbis collector",
    "puesto": "Backend",
    "cliente": "Jugadores de OSRS",
    "tipo": ["Aplicación de escritorio"],
    "lenguajes": ["C#"],
    "dbs": ["SQLite"],
    "frameworks": [".NET"],
    "url_sitio_web": "",
    "repositorio": "",
    "url_imagen_min": "17_min.jpg",
    "url_imagen_max": "17_max.jpg",
    "descripcion": "Se trata de un bot capaz de hacer el recorrido para tomar los orbis, el bot no pudo ser completado, solo llegaba hasta la zona del demon donde el jugador debía continuar el recorrido, no fue completado pues fue uno de los ultmos proyectos hechos antes de terminar abandonando el proyecto de los bots. Sin embargo fue un reto lo que se logró hacer pues el recorrido en si es un poco largo.",
    "descripcion_2": ""
  },

  {
    "number_project": 18,
    "id_empresa": 5,
    "nivel_importancia": 10,
    "titulo": "Flintstones",
    "puesto": "Backend",
    "cliente": "Jugadores de OSRS",
    "tipo": ["Aplicación de escritorio"],
    "lenguajes": ["C#"],
    "dbs": ["SQLite"],
    "frameworks": [".NET"],
    "url_sitio_web": "",
    "repositorio": "",
    "url_imagen_min": "18_min.jpg",
    "url_imagen_max": "18_max.jpg",
    "descripcion": "Este es un bot encargado de subir los niveles de minería del personaje, su función es muy simple, pica las 4 piedras que lo rodeen al detectar que tenga algún mineral, repite el proceso hasta llenar el bolso y luego se dirige al banco.",
    "descripcion_2": ""
  },

  {
    "number_project": 19,
    "id_empresa": 5,
    "nivel_importancia": 10,
    "titulo": "Woodcutter",
    "puesto": "Backend",
    "cliente": "Jugadores de OSRS",
    "tipo": ["Aplicación de escritorio"],
    "lenguajes": ["C#"],
    "dbs": ["SQLite"],
    "frameworks": [".NET"],
    "url_sitio_web": "",
    "repositorio": "",
    "url_imagen_min": "19_min.jpg",
    "url_imagen_max": "19_max.jpg",
    "descripcion": "Este bot ayuda a subir los niveles de tala de árboles, donde simplemente se para frente a un árbol y espera a que termine de talarlo, vacía el bolso cuando esté lleno de troncos y busca otro árbol una vez se desgaste el que esté usando en el momento. <br /><br /> Más adelante se adaptó una función que en vez de botar los troncos, use un encendedor del bolso para prender fuego con ellos y así subir también los niveles de hacer fogatas al mismo tiempo.",
    "descripcion_2": ""
  },

  {
    "number_project": 20,
    "id_empresa": 5,
    "nivel_importancia": 10,
    "titulo": "Cow killer",
    "puesto": "Backend",
    "cliente": "Jugadores de OSRS",
    "tipo": ["Aplicación de escritorio"],
    "lenguajes": ["C#"],
    "dbs": ["SQLite"],
    "frameworks": [".NET"],
    "url_sitio_web": "",
    "repositorio": "",
    "url_imagen_min": "20_min.jpg",
    "url_imagen_max": "20_max.jpg",
    "descripcion": "Es un bot que permite subir los niveles más bajos (un jugador iniciado), programado para buscar vacas en el mapa y dar la orden de matarlos, repitiendo el proceso hasta que alcance el nivel mínimo requerido para usar el siguiente bot para niveles intermedios.",
    "descripcion_2": ""
  },

  {
    "number_project": 22,
    "id_empresa": 5,
    "nivel_importancia": 10,
    "titulo": "Alerter",
    "puesto": "Backend",
    "cliente": "Jugadores de OSRS",
    "tipo": ["Aplicación de escritorio"],
    "lenguajes": ["C#"],
    "dbs": ["SQLite"],
    "frameworks": [".NET"],
    "url_sitio_web": "",
    "repositorio": "",
    "url_imagen_min": "22_min.jpg",
    "url_imagen_max": "22_max.jpg",
    "descripcion": "Fue el primer bot que cree y el más simple, no interactúa en lo más mínimo con el personaje, solo sirve para lanzar alertas y mantener al jugador más al tanto de cosas que podría costarle estar pendiente, por ejemplo… si esta en combate contra otros jugadores, el bot le alertara si se está quedando sin vida o sin posiciones, dándole un plus de ventaja sobre otros jugadores. <br /><br /> De este bot nació el nombre Jarvis, pues su uso me recordó a Jarvis la inteligencia artificial de la película de iron man el cual resultaba ser un útil compañero al mantener al portador del traje al tanto de temas que se le podrían escapar de las manos del usuario. <br /> <br /> Además de estos bots, también se crearon otras herramientas que eran útiles para programarlos, como un detector de pixeles que me decía el código de algún color que seleccionara de la pantalla y lo compara con otro para indicarme si es el mismo color o distintos.",
    "descripcion_2": ""
  },

  {
    "number_project": 23,
    "id_empresa": 6,
    "nivel_importancia": 3,
    "titulo": "Wamsfood",
    "puesto": "Backend",
    "cliente": "Wamsmobile",
    "tipo": ["Aplicación Web", "Aplicación Mobil"],
    "lenguajes": ["C#", "Javascript"],
    "dbs": ["PostgreSQL"],
    "frameworks": ["Node", "React", "Unity 3D"],
    "url_sitio_web": "",
    "repositorio": "",
    "url_imagen_min": "23_min.jpg",
    "url_imagen_max": "23_max.jpg",
    "descripcion": "Se trata de una aplicación Web y Mobile hecho para mostrar un registro de restaurantes y negocios en las distintas partes de la ciudad Maracay para que sus usuarios puedan encontrar el sitio ideal para comprar comida más cercano.",
    "descripcion_2": "Colabore en el backend tanto Web como Mobile."
  },


  {
    "number_project": 24,
    "id_empresa": 6,
    "nivel_importancia": 3,
    "titulo": "Quick Shop.",
    "puesto": "Backend",
    "cliente": "Wamsmobile",
    "tipo": ["Aplicación Web", "Aplicación Mobil"],
    "lenguajes": ["C#", "Javascript"],
    "dbs": ["PostgreSQL"],
    "frameworks": ["Node", "React", "Unity 3D"],
    "url_sitio_web": "",
    "repositorio": "",
    "url_imagen_min": "24_min.jpg",
    "url_imagen_max": "24_max.jpg",
    "descripcion": "Se trata de una aplicación Web y Mobile hecha para hacer mercado a través de la App en los diferentes Súper Mercados registrados en el servicios, dicho mercado es entregado a domicilio por el costo extra que incluye el servicio.",
    "descripcion_2": "Colabore en el backend tanto Web como Mobile."
  },

  {
    "number_project": 25,
    "id_empresa": 6,
    "nivel_importancia": 3,
    "titulo": "High Marck health.",
    "puesto": "Backend",
    "cliente": "Wamsmobile",
    "tipo": ["Aplicación Web", "Aplicación Mobil"],
    "lenguajes": ["C#", "Javascript"],
    "dbs": ["PostgreSQL"],
    "frameworks": ["Node", "React", "Unity 3D"],
    "url_sitio_web": "",
    "repositorio": "",
    "url_imagen_min": "25_min.jpg",
    "url_imagen_max": "25_max.jpg",
    "descripcion": "Se trata de una aplicación Web y Mobile hecho para ofrecer los servicios Médicos del cliente, además de contar con algunas funciones curiosas como el poder usar el teléfono inteligente como un termómetro corporal.",
    "descripcion_2": "Colabore en el backend tanto Web como Mobile."
  },

  {
    "number_project": 26,
    "id_empresa": 6,
    "nivel_importancia": 3,
    "titulo": "Trans Aragua",
    "puesto": "Backend",
    "cliente": "Wamsmobile",
    "tipo": ["Aplicación Web", "Aplicación Mobil"],
    "lenguajes": ["C#", "Javascript"],
    "dbs": ["PostgreSQL"],
    "frameworks": ["Node", "React", "Unity 3D"],
    "url_sitio_web": "",
    "repositorio": "",
    "url_imagen_min": "26_min.jpg",
    "url_imagen_max": "26_max.jpg",
    "descripcion": "Se trata de una aplicación Web y Mobile que sirve como un Geo-localizador para encontrar los puntos de paradas de los bus que ofrece el servicio Trans Aragua, además puedes pagar el pasaje directamente desde allí.",
    "descripcion_2": "Colabore en el backend tanto Web como Mobile."
  },


  {
    "number_project": 27,
    "id_empresa": 6,
    "nivel_importancia": 3,
    "titulo": "Charadas bíblico",
    "puesto": "Backend",
    "cliente": "Wamsmobile",
    "tipo": ["Aplicación Web", "Aplicación Mobil"],
    "lenguajes": ["C#", "Javascript"],
    "dbs": ["PostgreSQL"],
    "frameworks": ["Node", "React", "Unity 3D"],
    "url_sitio_web": "",
    "repositorio": "",
    "url_imagen_min": "27_min.jpg",
    "url_imagen_max": "27_max.jpg",
    "descripcion": "Se trata de una juego se puede usar tanto a nivel Web y Mobile, El mismo tienen distintos modos para poder llevar al mundo real funciones que facilitan poder llevar a cabo un juego de charadas, cuyo tema principal es el de temas bíblicos.",
    "descripcion_2": "Colabore en el backend tanto Web como Mobile."
  },

  {
    "number_project": 28,
    "id_empresa": 6,
    "nivel_importancia": 3,
    "titulo": "Auto Control",
    "puesto": "Full-Stack",
    "cliente": "Wamsmobile",
    "tipo": ["Aplicación Web", "Aplicación Mobil"],
    "lenguajes": ["C#", "Javascript"],
    "dbs": ["PostgreSQL"],
    "frameworks": ["Node", "React", "Unity 3D"],
    "url_sitio_web": "",
    "repositorio": "",
    "url_imagen_min": "28_min.jpg",
    "url_imagen_max": "28_max.jpg",
    "descripcion": "Es una aplicación hecha para un auto lavado en Perú, Es un auto lavado ordinario y pequeño, donde a los dueños del lugar les pareció atractiva la idea de una aplicación con la que puedan llevar un registro y control de los autos que atienden, tomar en cuenta los clientes más frecuentes para hacerles descuentos y otras ventajas más. Colabore en el backend tanto Web como Mobile.",
    "descripcion_2": "En este proyecto colabore tanto en el Backend, Frontend y en su planificación inicial."
  },


  {
    "number_project": 29,
    "id_empresa": 6,
    "nivel_importancia": 3,
    "titulo": "Deliverys Maracay",
    "puesto": "Backend",
    "cliente": "Wamsmobile",
    "tipo": ["Aplicación Web", "Aplicación Mobil"],
    "lenguajes": ["C#", "Javascript"],
    "dbs": ["PostgreSQL"],
    "frameworks": ["Node", "React", "Unity 3D"],
    "url_sitio_web": "",
    "repositorio": "",
    "url_imagen_min": "29_min.jpg",
    "url_imagen_max": "29_max.jpg",
    "descripcion": "Se trata de una aplicación web hecha para ofrecer servicios de deliverys (a domicilio) en Maracay, una ciudad de Venezuela, el mismo permitía a los usuarios hacer uso de un mapa para indicar el lugar de recogida y entrega y a la vez sacar un presupuesto en base al tamaño y peso del paquete.",
    "descripcion_2": "En este proyecto colabore tanto en el back-end,front-end y en su planificación inicial."
  },

  {
    "number_project": 30,
    "id_empresa": 7,
    "nivel_importancia": 8,
    "titulo": "Tesseras",
    "puesto": "Full-Stack",
    "cliente": "Avantec.DS",
    "tipo": ["Aplicación Web"],
    "lenguajes": ["Php", "Javascript"],
    "dbs": ["MySQL"],
    "frameworks": [""],
    "url_sitio_web": "avantecds.com/tesseras",
    "repositorio": "",
    "url_imagen_min": "30_min.jpg",
    "url_imagen_max": "30_max.jpg",
    "descripcion": "Fuente Oficial de la pagina: Muchas veces, en las empresas existen procesos que se hacen muy agotadores, tediosos y hasta repetitivos. Sin embargo, hoy día, existen alternativas para reformular o acortar pasos, que le permitan a los diferentes departamentos aportarle valor a dicho proceso y se dé el resultado final, que es la satisfacción al cliente.<br /><br />Tesseras por ejemplo, es el software de AVANTEC.DS que permite utilizar canales de comunicación (redes sociales, aplicaciones de mensajería, chats) para el seguimiento de casos y tareas en una compañía.",
    "descripcion_2": "Ayude en la implementación de la nueva interfaces junto a mis compañeros, en la proyección de rutas y en las tracciones."
},


{
  "number_project": 31,
  "id_empresa": 7,
  "nivel_importancia": 9,
  "titulo": "PYMES",
  "puesto": "Full-Stack",
  "cliente": "Avantec.DS",
  "tipo": ["Aplicación Web"],
  "lenguajes": ["Php", "Javascript"],
  "dbs": ["MySQL"],
  "frameworks": [""],
  "url_sitio_web": "avantecds.com/facturacionpymes",
  "repositorio": "",
  "url_imagen_min": "31_min.jpg",
  "url_imagen_max": "31_max.jpg",
  "descripcion": "Fuente Oficial de la pagina: FACTURACION PYMES es una completa plataforma de facturación electrónica, que te permite cumplir con los requerimientos tributarios de una manera simple y sencilla, integrando el proceso contable y administrativo de tu empresa.",
  "descripcion_2": "Mi labor en esta aplicación fue darle protección a las rutas, premisos y privilegios, y también le adapte el código para las traducciones."
},


{
  "number_project": 32,
  "id_empresa": 7,
  "nivel_importancia": 10,
  "titulo": "Food.me",
  "puesto": "Full-Stack",
  "cliente": "Avantec.DS",
  "tipo": ["Aplicación Web", "Aplicación Mobile"],
  "lenguajes": ["PhP", "Javascript"],
  "dbs": ["MySQL"],
  "frameworks": [""],
  "url_sitio_web": "food.me",
  "repositorio": "",
  "url_imagen_min": "32_min.jpg",
  "url_imagen_max": "32_max.jpg",
  "descripcion": "Página para ofrecer servicios de venta de comida de los negocios asociados a la aplicación, por temas de confidencialidad no puedo dar muchos detalles de la aplicación.",
  "descripcion_2": "Colabore creando algunos de sus módulos a nivel tanto de backend como Frontend."
},


{
  "number_project": 33,
  "id_empresa": 7,
  "nivel_importancia": 11,
  "titulo": "nuevoamanecerlatin",
  "puesto": "Full-Stack",
  "cliente": "Avantec.DS",
  "tipo": ["Aplicación Web"],
  "lenguajes": ["Php", "Javascript"],
  "dbs": ["MySQL"],
  "frameworks": [""],
  "url_sitio_web": "nuevoamanecerlatin.org",
  "repositorio": "",
  "url_imagen_min": "33_min.jpg",
  "url_imagen_max": "33_max.jpg",
  "descripcion": "Es un una aplicación web que habla un poco respecto a esta función y da opciones de donativos para quienes quieran colaborar con sus proyectos. Ellos ofrecen ayuda a niños indígenas de bajos recurso de Costa Rica. La aplicación cuenta con funciones de blog, historial, y contactos, además permite compartir las noticias de su blog a través de las redes sociales.",
  "descripcion_2": "Mi trabajo en este proyecto fue cambiarle la plantilla a una más llamativa, migrar todas sus funciones a esta, y agregar información actualizada. También fui el responsable de adaptar las funciones para compartir las publicaciones en las redes y mejorar el código de otros desarrolladores antes de mí que carecían de sentido."
}


  ]
}
